OpenFOAM case folders/Double body/driftAngle6.00_rudderAngle6.0_CT0.500/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
	version     2.0;
	format      ascii;
	class       volVectorField;
	location    "0";
	object      U;
}

#include      "include/initialConditions";

dimensions    [0 1 -1 0 0 0 0];

internalField uniform (2.572222 0 0);

boundaryField
{
	#includeEtc	"caseDicts/setConstraintTypes"

	inlet
	{
		type	fixedValue;
		value	$internalField;
	}


	outlet
	{
		type	zeroGradient;
	}


	top
	{
		type	slip;
	}


	hull
	{
		type	fixedValue;
		value	uniform (0 0 0);
	}


	bow
	{
		type	fixedValue;
		value	uniform (0 0 0);
	}


	skeg
	{
		type	fixedValue;
		value	uniform (0 0 0);
	}


	skegEdge
	{
		type	fixedValue;
		value	uniform (0 0 0);
	}


	stern
	{
		type	fixedValue;
		value	uniform (0 0 0);
	}


	deck
	{
		type	fixedValue;
		value	uniform (0 0 0);
	}


	rudder
	{
		type	fixedValue;
		value	uniform (0 0 0);
	}


	rudderEdge
	{
		type	fixedValue;
		value	uniform (0 0 0);
	}

}
