OpenFOAM case folders/Double body/driftAngle6.00_rudderAngle6.0_CT0.500/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-60.29021173353066 -45.32688019821598 -30.58199145903729)
	(90.43531760029599 -45.32688019821598 -30.58199145903729)
	(90.43531760029599 45.32688019821598 -30.58199145903729)
	(-60.29021173353066 45.32688019821598 -30.58199145903729)
	(-60.29021173353066 -45.32688019821598 0)
	(90.43531760029599 -45.32688019821598 0)
	(90.43531760029599 45.32688019821598 0)
	(-60.29021173353066 45.32688019821598 0)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (138 83 28) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(3 2 6 7)
			(0 3 2 1)
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

