OpenFOAM case folders/Double body/driftAngle6.00_rudderAngle6.0_CT0.500/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	location    "system";
	object      createPatchDict;
}

pointSync false;

patches
(

{
	name             AMI1;
	patchInfo
	{
		type              cyclicAMI;
		matchTolerance    0.001;
		neighbourPatch    AMI2;
		transform         noOrdering;
	}
	constructFrom    patches;
	patches          (actuatorDisk);
}


{
	name             AMI2;
	patchInfo
	{
		type              cyclicAMI;
		matchTolerance    0.001;
		neighbourPatch    AMI1;
		transform         noOrdering;
	}
	constructFrom    patches;
	patches          (actuatorDisk_slave);
}

);
